# SQL Queries in Pandas Dataframe

In [1]:
# Doing this process you will get stuck for ever
#!conda install pandasql


# You can solve it by using the --yes parameter. 

!conda install --yes pandasql

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/zoumanakeita/opt/anaconda3

  added / updated specs:
    - pandasql


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    pandasql-0.7.3             |   py37hecd8cb5_1         319 KB
    ------------------------------------------------------------
                                           Total:         319 KB

The following NEW packages will be INSTALLED:

  pandasql           pkgs/main/osx-64::pandasql-0.7.3-py37hecd8cb5_1



Downloading and Extracting Packages
pandasql-0.7.3       | 319 KB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [6]:
from pandasql import sqldf

In [3]:
import pandas as pd

# Create Student Data Frame
students= {
    'Students':["Sira","Ibrahim","Moussa","Mamadou","Nabintou"],
    'Gender':['Female','Male','Male', "Male", "Female"],
    'Age':[18, 27, 19, 22, 21],
    'Email': ["sira@info.com", "ib@info.com", "mouss@info.com", 
             "mam@info.com", "nab@info.com"]
          }
students_df = pd.DataFrame(students)

students_df

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [4]:
# Create Teaching Assistant Data Frame
teaching_assistant= {
    'Teacher':["Ibrahim","Nabintou","Mamadou","Fatim","Aziz"],
    'Email':['ib@info.com','nab@info.com','mam@info.com', 
             "fat@info.com", "aziz@info.com"],
    'Degree':["M.S in Data Science", "B.S in Statistics", 
              "B. Comp Sc", "M.S. Architecture", "B.S in Accounting"],
    'Department': ["Business", "Statistics", "Comp Sc", 
             "Engineering", "Business"]
          }
teaching_assistant_df = pd.DataFrame(teaching_assistant)

teaching_assistant_df

    Teacher          Email               Degree   Department
0   Ibrahim    ib@info.com  M.S in Data Science     Business
1  Nabintou   nab@info.com    B.S in Statistics   Statistics
2   Mamadou   mam@info.com           B. Comp Sc      Comp Sc
3     Fatim   fat@info.com    M.S. Architecture  Engineering
4      Aziz  aziz@info.com    B.S in Accounting     Business

## 1. Data Selection

In [34]:
# We can get all the columns data as follow
all_students = sqldf("SELECT * FROM students_df")
all_students

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [38]:
print(type(all_students))
print("---"*10)
print(all_students.dtypes)

<class 'pandas.core.frame.DataFrame'>
------------------------------
Students    object
Gender      object
Age          int64
Email       object
dtype: object

In [13]:
type(all_cols)

pandas.core.frame.DataFrame

In [39]:
# Select the Student Name, and Email

query = """ SELECT Students, Email 
            FROM students_df 
            LIMIT 3
        """
name_email = sqldf(query)
name_email

  Students           Email
0     Sira   sira@info.com
1  Ibrahim     ib@info.com
2   Moussa  mouss@info.com

In [14]:
# Select Student Name, Email and Gender
selection = sqldf("SELECT Students, Email, Gender FROM students_df")
selection

   Students           Email  Gender
0      Sira   sira@info.com  Female
1   Ibrahim     ib@info.com    Male
2    Moussa  mouss@info.com    Male
3   Mamadou    mam@info.com    Male
4  Nabintou    nab@info.com  Female

## Data Filtering

In [41]:
# Define the query
query = """SELECT * 
           FROM students_df 
           WHERE Gender = 'Female'
        """

# Execute the query
female_student = sqldf(query)
female_student

   Students  Gender  Age          Email
0      Sira  Female   18  sira@info.com
1  Nabintou  Female   21   nab@info.com

In [27]:
# Select Name, Gender & Email of all the Masters Students
query = """ SELECT Teacher, Email, Degree 
            FROM teaching_assistant_df 
            WHERE Degree LIKE 'M.S%'
            """
ms_students = sqldf(query)
ms_students

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
1    Fatim  fat@info.com    M.S. Architecture

In [46]:
# Pandas Equivalent 
cols_to_get = ['Teacher', 'Email', 'Degree']
teaching_assistant_df[teaching_assistant_df.Degree.str.startswith('M.S')][cols_to_get]

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
3    Fatim  fat@info.com    M.S. Architecture

## Data Aggregation

In [28]:
# Get the average age Gender Wise
query = """ SELECT AVG(Age), Gender 
            FROM students_df 
            GROUP BY Gender
        """
avg_age = sqldf(query)
avg_age

    AVG(Age)  Gender
0  19.500000  Female
1  22.666667    Male

In [29]:
# Count the number of occurence of each department

query = """ SELECT Department, COUNT(*) as Depart_Count
            FROM teaching_assistant_df 
            GROUP BY Department
            ORDER BY Depart_Count DESC;
        """

depart_count = sqldf(query)
depart_count

    Department  Depart_Count
0     Business             2
1   Statistics             1
2  Engineering             1
3      Comp Sc             1

## Joins

In [32]:
# Select Students who are Teacher assistants along with their departments

query = """ SELECT st.Students, st.Gender, st.Email, st.Age, tat.Department
            FROM students_df st INNER JOIN teaching_assistant_df tat 
            ON st.Email = tat.Email;
            """

result = sqldf(query)
result

   Students  Gender         Email  Age  Department
0   Ibrahim    Male   ib@info.com   27    Business
1   Mamadou    Male  mam@info.com   22     Comp Sc
2  Nabintou  Female  nab@info.com   21  Statistics